WeSpeakEnglish/STM32PLC/IAR/PLC/Inc/tw8819.h
#ifndef __TW8819_H
#define __TW8819_H
#include "stm32f7xx.h"
#include "variables.h"
#define	TW8819_ADDRESS		        0x8A

#define PAGE0_GENERAL		        0x00
#define PAGE0_OUTPUT		        0x00	//0x007::0x00F & 0x01F
#define PAGE0_INPUT			0x00	//0x040::0x046
#define PAGE0_BT656			0x00	//0x047::0x04A
#define PAGE0_DTV			0x00	//0x050::0x05F
#define PAGE0_GPIO			0x00	//0x080::0x09E
#define PAGE0_MBIST			0x00	//0x0A0::0x0A4
#define PAGE0_TOUCH			0x00	//0x0B0::0x0B4
#define PAGE0_LOPOR			0x00	//0x0D4::0x0DF
#define PAGE0_LEDC			0x00	//0x0E0::0x0E6
#define PAGE0_DCDC			0x00	//0x0E8::0x0EC
#define PAGE0_VCOM			0x00	//0x0ED::0x0EE
#define PAGE0_SSPLL			0x00	//0x0F6::0x0FD
#define PAGE1_DECODER		        0x01	//0x101::0x142
#define PAGE1_VADC			0x01	//0x1C0::0x1E7	include LLPLL
#define PAGE2_SCALER		        0x02	//0x201::0x21E
#define PAGE2_TCON			0x02	//0x240::0x24E
#define PAGE2_IMAGE			0x02	//0x280::0x2BF
#define PAGE2_GAMMA			0x02	//0x2E0::0x2E3 include LCDC
#define PAGE2_DITHER		        0x02	//0x2E4::0x2E4
#define PAGE2_RGBLEVEL		        0x02	//0x2F0::0x2F5
#define PAGE2_8BITPANEL		        0x02	//0x2F8::0x2F9
#define PAGE3_FOSD			0x03	//0x300::0x354
#define PAGE4_SOSD			0x04	//0x400::0x3BE
#define PAGE3_SPI			0x04	//0x4C0::0x4DA include MCU
#define PAGE4_SPI			0x04	//0x4C0::0x4DA include MCU
#define TWBASE_SPI			0xC0	//note:Not a page. it is a offset.
#define PAGE4_CLOCK			0x04	//0x4E0::0x4EB
#define PAGE5_MEAS			0x05	//0x500::0x545

//===========================
// PAGE 0
//===========================
	#define REG000	0x00
	#define REG001	0x01
	#define REG002	0x02
	#define REG003	0x03
	#define REG004	0x04
	#define REG005	0x05
	#define REG006	0x06
	#define REG007	0x07
	#define REG008	0x08
	#define REG009	0x09
	#define REG00A	0x0A
	#define REG00B	0x0B
	#define REG00C	0x0C
	#define REG00D	0x0D
	#define REG00E	0x0E
	#define REG00F	0x0F

	#define REG010	0x10
	#define REG011	0x11
	#define REG012	0x12
	#define REG013	0x13
	#define REG014	0x14
	#define REG015	0x15
	#define REG016	0x16
	#define REG017	0x17
	#define REG018	0x18
	#define REG019	0x19
	#define REG01A	0x1A
	#define REG01B	0x1B
	#define REG01C	0x1C
	#define REG01D	0x1D
	#define REG01E	0x1E
	#define REG01F	0x1F

	#define REG020	0x20
	#define REG021	0x21
	#define REG022	0x22
	#define REG023	0x23
	#define REG024	0x24
	#define REG025	0x25
	#define REG026	0x26
	#define REG027	0x27
	#define REG028	0x28
	#define REG029	0x29
	#define REG02A	0x2A
	#define REG02B	0x2B
	#define REG02C	0x2C
	#define REG02D	0x2D
	#define REG02E	0x2E
	#define REG02F	0x2F

	#define REG030	0x30
	#define REG031	0x31
	#define REG032	0x32
	#define REG033	0x33
	#define REG034	0x34
	#define REG035	0x35
	#define REG036	0x36
	#define REG037	0x37
	#define REG038	0x38
	#define REG039	0x39
	#define REG03A	0x3A
	#define REG03B	0x3B
	#define REG03C	0x3C
	#define REG03D	0x3D
	#define REG03E	0x3E
	#define REG03F	0x3F

	#define REG040	0x40
	#define REG041	0x41
	#define REG042	0x42
	#define REG043	0x43
	#define REG044	0x44
	#define REG045	0x45
	#define REG046	0x46
	#define REG047	0x47
	#define REG048	0x48
	#define REG049	0x49
	#define REG04A	0x4A
	#define REG04B	0x4B
	#define REG04C	0x4C
	#define REG04D	0x4D
	#define REG04E	0x4E
	#define REG04F	0x4F

	#define REG050	0x50
	#define REG051	0x51
	#define REG052	0x52
	#define REG053	0x53
	#define REG054	0x54
	#define REG055	0x55
	#define REG056	0x56
	#define REG057	0x57
	#define REG058	0x58
	#define REG059	0x59
	#define REG05A	0x5A
	#define REG05B	0x5B
	#define REG05C	0x5C
	#define REG05D	0x5D
	#define REG05E	0x5E
	#define REG05F	0x5F

	#define REG060	0x60
	#define REG061	0x61
	#define REG062	0x62
	#define REG063	0x63
	#define REG064	0x64
	#define REG065	0x65
	#define REG066	0x66
	#define REG067	0x67
	#define REG068	0x68
	#define REG069	0x69
	#define REG06A	0x6A
	#define REG06B	0x6B
	#define REG06C	0x6C
	#define REG06D	0x6D
	#define REG06E	0x6E
	#define REG06F	0x6F

	#define REG070	0x70
	#define REG071	0x71
	#define REG072	0x72
	#define REG073	0x73
	#define REG074	0x74
	#define REG075	0x75
	#define REG076	0x76
	#define REG077	0x77
	#define REG078	0x78
	#define REG079	0x79
	#define REG07A	0x7A
	#define REG07B	0x7B
	#define REG07C	0x7C
	#define REG07D	0x7D
	#define REG07E	0x7E
	#define REG07F	0x7F

	#define REG080	0x80
	#define REG081	0x81
	#define REG082	0x82
	#define REG083	0x83
	#define REG084	0x84
	#define REG085	0x85
	#define REG086	0x86
	#define REG087	0x87
	#define REG088	0x88
	#define REG089	0x89
	#define REG08A	0x8A
	#define REG08B	0x8B
	#define REG08C	0x8C
	#define REG08D	0x8D
	#define REG08E	0x8E
	#define REG08F	0x8F

	#define REG090	0x90
	#define REG091	0x91
	#define REG092	0x92
	#define REG093	0x93
	#define REG094	0x94
	#define REG095	0x95
	#define REG096	0x96
	#define REG097	0x97
	#define REG098	0x98
	#define REG099	0x99
	#define REG09A	0x9A
	#define REG09B	0x9B
	#define REG09C	0x9C
	#define REG09D	0x9D
	#define REG09E	0x9E
	#define REG09F	0x9F

	#define REG0A0	0xA0
	#define REG0A1	0xA1
	#define REG0A2	0xA2
	#define REG0A3	0xA3
	#define REG0A4	0xA4
	#define REG0A5	0xA5
	#define REG0A6	0xA6
	#define REG0A7	0xA7
	#define REG0A8	0xA8
	#define REG0A9	0xA9
	#define REG0AA	0xAA
	#define REG0AB	0xAB
	#define REG0AC	0xAC
	#define REG0AD	0xAD
	#define REG0AE	0xAE
	#define REG0AF	0xAF

	#define REG0B0	0xB0
	#define REG0B1	0xB1
	#define REG0B2	0xB2
	#define REG0B3	0xB3
	#define REG0B4	0xB4
	#define REG0B5	0xB5
	#define REG0B6	0xB6
	#define REG0B7	0xB7
	#define REG0B8	0xB8
	#define REG0B9	0xB9
	#define REG0BA	0xBA
	#define REG0BB	0xBB
	#define REG0BC	0xBC
	#define REG0BD	0xBD
	#define REG0BE	0xBE
	#define REG0BF	0xBF

	#define REG0C0	0xC0
	#define REG0C1	0xC1
	#define REG0C2	0xC2
	#define REG0C3	0xC3
	#define REG0C4	0xC4
	#define REG0C5	0xC5
	#define REG0C6	0xC6
	#define REG0C7	0xC7
	#define REG0C8	0xC8
	#define REG0C9	0xC9
	#define REG0CA	0xCA
	#define REG0CB	0xCB
	#define REG0CC	0xCC
	#define REG0CD	0xCD
	#define REG0CE	0xCE
	#define REG0CF	0xCF

	#define REG0D0	0xD0
	#define REG0D1	0xD1
	#define REG0D2	0xD2
	#define REG0D3	0xD3
	#define REG0D4	0xD4
	#define REG0D5	0xD5
	#define REG0D6	0xD6
	#define REG0D7	0xD7
	#define REG0D8	0xD8
	#define REG0D9	0xD9
	#define REG0DA	0xDA
	#define REG0DB	0xDB
	#define REG0DC	0xDC
	#define REG0DD	0xDD
	#define REG0DE	0xDE
	#define REG0DF	0xDF

