WeSpeakEnglish/STM32PLC/IAR/PLC/Inc/tw8819.h
	#define REG0E0	0xE0
	#define REG0E1	0xE1
	#define REG0E2	0xE2
	#define REG0E3	0xE3
	#define REG0E4	0xE4
	#define REG0E5	0xE5
	#define REG0E6	0xE6
	#define REG0E7	0xE7
	#define REG0E8	0xE8
	#define REG0E9	0xE9
	#define REG0EA	0xEA
	#define REG0EB	0xEB
	#define REG0EC	0xEC
	#define REG0ED	0xED
	#define REG0EE	0xEE
	#define REG0EF	0xEF

	#define REG0F0	0xF0
	#define REG0F1	0xF1
	#define REG0F2	0xF2
	#define REG0F3	0xF3
	#define REG0F4	0xF4
	#define REG0F5	0xF5
	#define REG0F6	0xF6
	#define REG0F7	0xF7
	#define REG0F8	0xF8
	#define REG0F9	0xF9
	#define REG0FA	0xFA
	#define REG0FB	0xFB
	#define REG0FC	0xFC
	#define REG0FD	0xFD
	#define REG0FE	0xFE
	//#define REG0FF	0xFF

//===========================
// PAGE 1
//===========================
	#define REG100	0x00
	#define REG101	0x01
	#define REG102	0x02
	#define REG103	0x03
	#define REG104	0x04
	#define REG105	0x05
	#define REG106	0x06
	#define REG107	0x07
	#define REG108	0x08
	#define REG109	0x09
	#define REG10A	0x0A
	#define REG10B	0x0B
	#define REG10C	0x0C
	#define REG10D	0x0D
	#define REG10E	0x0E
	#define REG10F	0x0F

	#define REG110	0x10
	#define REG111	0x11
	#define REG112	0x12
	#define REG113	0x13
	#define REG114	0x14
	#define REG115	0x15
	#define REG116	0x16
	#define REG117	0x17
	#define REG118	0x18
	#define REG119	0x19
	#define REG11A	0x1A
	#define REG11B	0x1B
	#define REG11C	0x1C
	#define REG11D	0x1D
	#define REG11E	0x1E
	#define REG11F	0x1F

	#define REG120	0x20
	#define REG121	0x21
	#define REG122	0x22
	#define REG123	0x23
	#define REG124	0x24
	#define REG125	0x25
	#define REG126	0x26
	#define REG127	0x27
	#define REG128	0x28
	#define REG129	0x29
	#define REG12A	0x2A
	#define REG12B	0x2B
	#define REG12C	0x2C
	#define REG12D	0x2D
	#define REG12E	0x2E
	#define REG12F	0x2F

	#define REG130	0x30
	#define REG131	0x31
	#define REG132	0x32
	#define REG133	0x33
	#define REG134	0x34
	#define REG135	0x35
	#define REG136	0x36
	#define REG137	0x37
	#define REG138	0x38
	#define REG139	0x39
	#define REG13A	0x3A
	#define REG13B	0x3B
	#define REG13C	0x3C
	#define REG13D	0x3D
	#define REG13E	0x3E
	#define REG13F	0x3F

	#define REG140	0x40
	#define REG141	0x41
	#define REG142	0x42
	#define REG143	0x43
	#define REG144	0x44
	#define REG145	0x45
	#define REG146	0x46
	#define REG147	0x47
	#define REG148	0x48
	#define REG149	0x49
	#define REG14A	0x4A
	#define REG14B	0x4B
	#define REG14C	0x4C
	#define REG14D	0x4D
	#define REG14E	0x4E
	#define REG14F	0x4F

	#define REG150	0x50
	#define REG151	0x51
	#define REG152	0x52
	#define REG153	0x53
	#define REG154	0x54
	#define REG155	0x55
	#define REG156	0x56
	#define REG157	0x57
	#define REG158	0x58
	#define REG159	0x59
	#define REG15A	0x5A
	#define REG15B	0x5B
	#define REG15C	0x5C
	#define REG15D	0x5D
	#define REG15E	0x5E
	#define REG15F	0x5F

	#define REG160	0x60
	#define REG161	0x61
	#define REG162	0x62
	#define REG163	0x63
	#define REG164	0x64
	#define REG165	0x65
	#define REG166	0x66
	#define REG167	0x67
	#define REG168	0x68
	#define REG169	0x69
	#define REG16A	0x6A
	#define REG16B	0x6B
	#define REG16C	0x6C
	#define REG16D	0x6D
	#define REG16E	0x6E
	#define REG16F	0x6F

	#define REG170	0x70
	#define REG171	0x71
	#define REG172	0x72
	#define REG173	0x73
	#define REG174	0x74
	#define REG175	0x75
	#define REG176	0x76
	#define REG177	0x77
	#define REG178	0x78
	#define REG179	0x79
	#define REG17A	0x7A
	#define REG17B	0x7B
	#define REG17C	0x7C
	#define REG17D	0x7D
	#define REG17E	0x7E
	#define REG17F	0x7F

	#define REG180	0x80
	#define REG181	0x81
	#define REG182	0x82
	#define REG183	0x83
	#define REG184	0x84
	#define REG185	0x85
	#define REG186	0x86
	#define REG187	0x87
	#define REG188	0x88
	#define REG189	0x89
	#define REG18A	0x8A
	#define REG18B	0x8B
	#define REG18C	0x8C
	#define REG18D	0x8D
	#define REG18E	0x8E
	#define REG18F	0x8F

	#define REG190	0x90
	#define REG191	0x91
	#define REG192	0x92
	#define REG193	0x93
	#define REG194	0x94
	#define REG195	0x95
	#define REG196	0x96
	#define REG197	0x97
	#define REG198	0x98
	#define REG199	0x99
	#define REG19A	0x9A
	#define REG19B	0x9B
	#define REG19C	0x9C
	#define REG19D	0x9D
	#define REG19E	0x9E
	#define REG19F	0x9F

	#define REG1A0	0xA0
	#define REG1A1	0xA1
	#define REG1A2	0xA2
	#define REG1A3	0xA3
	#define REG1A4	0xA4
	#define REG1A5	0xA5
	#define REG1A6	0xA6
	#define REG1A7	0xA7
	#define REG1A8	0xA8
	#define REG1A9	0xA9
	#define REG1AA	0xAA
	#define REG1AB	0xAB
	#define REG1AC	0xAC
	#define REG1AD	0xAD
	#define REG1AE	0xAE
	#define REG1AF	0xAF

	#define REG1B0	0xB0
	#define REG1B1	0xB1
	#define REG1B2	0xB2
	#define REG1B3	0xB3
	#define REG1B4	0xB4
	#define REG1B5	0xB5
	#define REG1B6	0xB6
	#define REG1B7	0xB7
	#define REG1B8	0xB8
	#define REG1B9	0xB9
	#define REG1BA	0xBA
	#define REG1BB	0xBB
	#define REG1BC	0xBC
	#define REG1BD	0xBD
	#define REG1BE	0xBE
	#define REG1BF	0xBF

	#define REG1C0	0xC0
	#define REG1C1	0xC1
	#define REG1C2	0xC2
	#define REG1C3	0xC3
	#define REG1C4	0xC4
	#define REG1C5	0xC5
	#define REG1C6	0xC6
	#define REG1C7	0xC7
	#define REG1C8	0xC8
	#define REG1C9	0xC9
	#define REG1CA	0xCA
	#define REG1CB	0xCB
	#define REG1CC	0xCC
	#define REG1CD	0xCD
	#define REG1CE	0xCE
	#define REG1CF	0xCF

	#define REG1D0	0xD0
	#define REG1D1	0xD1
	#define REG1D2	0xD2
	#define REG1D3	0xD3
	#define REG1D4	0xD4
	#define REG1D5	0xD5
	#define REG1D6	0xD6
	#define REG1D7	0xD7
	#define REG1D8	0xD8
	#define REG1D9	0xD9
	#define REG1DA	0xDA
	#define REG1DB	0xDB
	#define REG1DC	0xDC
	#define REG1DD	0xDD
	#define REG1DE	0xDE
	#define REG1DF	0xDF

	#define REG1E0	0xE0
	#define REG1E1	0xE1
	#define REG1E2	0xE2
	#define REG1E3	0xE3
	#define REG1E4	0xE4
	#define REG1E5	0xE5
	#define REG1E6	0xE6
	#define REG1E7	0xE7
	#define REG1E8	0xE8
	#define REG1E9	0xE9
	#define REG1EA	0xEA
	#define REG1EB	0xEB
	#define REG1EC	0xEC
	#define REG1ED	0xED
	#define REG1EE	0xEE
	#define REG1EF	0xEF

	#define REG1F0	0xF0
	#define REG1F1	0xF1
	#define REG1F2	0xF2
	#define REG1F3	0xF3
	#define REG1F4	0xF4
	#define REG1F5	0xF5
	#define REG1F6	0xF6
	#define REG1F7	0xF7
	#define REG1F8	0xF8
	#define REG1F9	0xF9
	#define REG1FA	0xFA
	#define REG1FB	0xFB
	#define REG1FC	0xFC
	#define REG1FD	0xFD
	#define REG1FE	0xFE
	//#define REG1FF	0xFF
//===========================
// PAGE 2
//===========================
	#define REG200	0x00
	#define REG201	0x01
	#define REG202	0x02
	#define REG203	0x03
	#define REG204	0x04
	#define REG205	0x05
	#define REG206	0x06
	#define REG207	0x07
	#define REG208	0x08
	#define REG209	0x09
	#define REG20A	0x0A
	#define REG20B	0x0B
	#define REG20C	0x0C
	#define REG20D	0x0D
	#define REG20E	0x0E
	#define REG20F	0x0F

	#define REG210	0x10
	#define REG211	0x11
	#define REG212	0x12
	#define REG213	0x13
	#define REG214	0x14
	#define REG215	0x15
	#define REG216	0x16
	#define REG217	0x17
	#define REG218	0x18
	#define REG219	0x19
	#define REG21A	0x1A
	#define REG21B	0x1B
	#define REG21C	0x1C
	#define REG21D	0x1D
	#define REG21E	0x1E
	#define REG21F	0x1F

	#define REG220	0x20
	#define REG221	0x21
	#define REG222	0x22
	#define REG223	0x23
	#define REG224	0x24
	#define REG225	0x25
	#define REG226	0x26
	#define REG227	0x27
	#define REG228	0x28
	#define REG229	0x29
	#define REG22A	0x2A
	#define REG22B	0x2B
	#define REG22C	0x2C
	#define REG22D	0x2D
	#define REG22E	0x2E
	#define REG22F	0x2F

