WeSpeakEnglish/STM32PLC/IAR/PLC/Inc/tw8819.h
	#define REG230	0x30
	#define REG231	0x31
	#define REG232	0x32
	#define REG233	0x33
	#define REG234	0x34
	#define REG235	0x35
	#define REG236	0x36
	#define REG237	0x37
	#define REG238	0x38
	#define REG239	0x39
	#define REG23A	0x3A
	#define REG23B	0x3B
	#define REG23C	0x3C
	#define REG23D	0x3D
	#define REG23E	0x3E
	#define REG23F	0x3F

	#define REG240	0x40
	#define REG241	0x41
	#define REG242	0x42
	#define REG243	0x43
	#define REG244	0x44
	#define REG245	0x45
	#define REG246	0x46
	#define REG247	0x47
	#define REG248	0x48
	#define REG249	0x49
	#define REG24A	0x4A
	#define REG24B	0x4B
	#define REG24C	0x4C
	#define REG24D	0x4D
	#define REG24E	0x4E
	#define REG24F	0x4F

	#define REG250	0x50
	#define REG251	0x51
	#define REG252	0x52
	#define REG253	0x53
	#define REG254	0x54
	#define REG255	0x55
	#define REG256	0x56
	#define REG257	0x57
	#define REG258	0x58
	#define REG259	0x59
	#define REG25A	0x5A
	#define REG25B	0x5B
	#define REG25C	0x5C
	#define REG25D	0x5D
	#define REG25E	0x5E
	#define REG25F	0x5F

	#define REG260	0x60
	#define REG261	0x61
	#define REG262	0x62
	#define REG263	0x63
	#define REG264	0x64
	#define REG265	0x65
	#define REG266	0x66
	#define REG267	0x67
	#define REG268	0x68
	#define REG269	0x69
	#define REG26A	0x6A
	#define REG26B	0x6B
	#define REG26C	0x6C
	#define REG26D	0x6D
	#define REG26E	0x6E
	#define REG26F	0x6F

	#define REG270	0x70
	#define REG271	0x71
	#define REG272	0x72
	#define REG273	0x73
	#define REG274	0x74
	#define REG275	0x75
	#define REG276	0x76
	#define REG277	0x77
	#define REG278	0x78
	#define REG279	0x79
	#define REG27A	0x7A
	#define REG27B	0x7B
	#define REG27C	0x7C
	#define REG27D	0x7D
	#define REG27E	0x7E
	#define REG27F	0x7F

	#define REG280	0x80
	#define REG281	0x81
	#define REG282	0x82
	#define REG283	0x83
	#define REG284	0x84
	#define REG285	0x85
	#define REG286	0x86
	#define REG287	0x87
	#define REG288	0x88
	#define REG289	0x89
	#define REG28A	0x8A
	#define REG28B	0x8B
	#define REG28C	0x8C
	#define REG28D	0x8D
	#define REG28E	0x8E
	#define REG28F	0x8F

	#define REG290	0x90
	#define REG291	0x91
	#define REG292	0x92
	#define REG293	0x93
	#define REG294	0x94
	#define REG295	0x95
	#define REG296	0x96
	#define REG297	0x97
	#define REG298	0x98
	#define REG299	0x99
	#define REG29A	0x9A
	#define REG29B	0x9B
	#define REG29C	0x9C
	#define REG29D	0x9D
	#define REG29E	0x9E
	#define REG29F	0x9F

	#define REG2A0	0xA0
	#define REG2A1	0xA1
	#define REG2A2	0xA2
	#define REG2A3	0xA3
	#define REG2A4	0xA4
	#define REG2A5	0xA5
	#define REG2A6	0xA6
	#define REG2A7	0xA7
	#define REG2A8	0xA8
	#define REG2A9	0xA9
	#define REG2AA	0xAA
	#define REG2AB	0xAB
	#define REG2AC	0xAC
	#define REG2AD	0xAD
	#define REG2AE	0xAE
	#define REG2AF	0xAF

	#define REG2B0	0xB0
	#define REG2B1	0xB1
	#define REG2B2	0xB2
	#define REG2B3	0xB3
	#define REG2B4	0xB4
	#define REG2B5	0xB5
	#define REG2B6	0xB6
	#define REG2B7	0xB7
	#define REG2B8	0xB8
	#define REG2B9	0xB9
	#define REG2BA	0xBA
	#define REG2BB	0xBB
	#define REG2BC	0xBC
	#define REG2BD	0xBD
	#define REG2BE	0xBE
	#define REG2BF	0xBF

	#define REG2C0	0xC0
	#define REG2C1	0xC1
	#define REG2C2	0xC2
	#define REG2C3	0xC3
	#define REG2C4	0xC4
	#define REG2C5	0xC5
	#define REG2C6	0xC6
	#define REG2C7	0xC7
	#define REG2C8	0xC8
	#define REG2C9	0xC9
	#define REG2CA	0xCA
	#define REG2CB	0xCB
	#define REG2CC	0xCC
	#define REG2CD	0xCD
	#define REG2CE	0xCE
	#define REG2CF	0xCF

	#define REG2D0	0xD0
	#define REG2D1	0xD1
	#define REG2D2	0xD2
	#define REG2D3	0xD3
	#define REG2D4	0xD4
	#define REG2D5	0xD5
	#define REG2D6	0xD6
	#define REG2D7	0xD7
	#define REG2D8	0xD8
	#define REG2D9	0xD9
	#define REG2DA	0xDA
	#define REG2DB	0xDB
	#define REG2DC	0xDC
	#define REG2DD	0xDD
	#define REG2DE	0xDE
	#define REG2DF	0xDF

	#define REG2E0	0xE0
	#define REG2E1	0xE1
	#define REG2E2	0xE2
	#define REG2E3	0xE3
	#define REG2E4	0xE4
	#define REG2E5	0xE5
	#define REG2E6	0xE6
	#define REG2E7	0xE7
	#define REG2E8	0xE8
	#define REG2E9	0xE9
	#define REG2EA	0xEA
	#define REG2EB	0xEB
	#define REG2EC	0xEC
	#define REG2ED	0xED
	#define REG2EE	0xEE
	#define REG2EF	0xEF

	#define REG2F0	0xF0
	#define REG2F1	0xF1
	#define REG2F2	0xF2
	#define REG2F3	0xF3
	#define REG2F4	0xF4
	#define REG2F5	0xF5
	#define REG2F6	0xF6
	#define REG2F7	0xF7
	#define REG2F8	0xF8
	#define REG2F9	0xF9
	#define REG2FA	0xFA
	#define REG2FB	0xFB
	#define REG2FC	0xFC
	#define REG2FD	0xFD
	#define REG2FE	0xFE
	//#define REG2FF	0xFF

//===========================
// PAGE 3
//===========================
	#define REG300	0x00
	#define REG301	0x01
	#define REG302	0x02
	#define REG303	0x03
	#define REG304	0x04
	#define REG305	0x05
	#define REG306	0x06
	#define REG307	0x07
	#define REG308	0x08
	#define REG309	0x09
	#define REG30A	0x0A
	#define REG30B	0x0B
	#define REG30C	0x0C
	#define REG30D	0x0D
	#define REG30E	0x0E
	#define REG30F	0x0F

	#define REG310	0x10
	#define REG311	0x11
	#define REG312	0x12
	#define REG313	0x13
	#define REG314	0x14
	#define REG315	0x15
	#define REG316	0x16
	#define REG317	0x17
	#define REG318	0x18
	#define REG319	0x19
	#define REG31A	0x1A
	#define REG31B	0x1B
	#define REG31C	0x1C
	#define REG31D	0x1D
	#define REG31E	0x1E
	#define REG31F	0x1F

	#define REG320	0x20
	#define REG321	0x21
	#define REG322	0x22
	#define REG323	0x23
	#define REG324	0x24
	#define REG325	0x25
	#define REG326	0x26
	#define REG327	0x27
	#define REG328	0x28
	#define REG329	0x29
	#define REG32A	0x2A
	#define REG32B	0x2B
	#define REG32C	0x2C
	#define REG32D	0x2D
	#define REG32E	0x2E
	#define REG32F	0x2F

	#define REG330	0x30
	#define REG331	0x31
	#define REG332	0x32
	#define REG333	0x33
	#define REG334	0x34
	#define REG335	0x35
	#define REG336	0x36
	#define REG337	0x37
	#define REG338	0x38
	#define REG339	0x39
	#define REG33A	0x3A
	#define REG33B	0x3B
	#define REG33C	0x3C
	#define REG33D	0x3D
	#define REG33E	0x3E
	#define REG33F	0x3F

	#define REG340	0x40
	#define REG341	0x41
	#define REG342	0x42
	#define REG343	0x43
	#define REG344	0x44
	#define REG345	0x45
	#define REG346	0x46
	#define REG347	0x47
	#define REG348	0x48
	#define REG349	0x49
	#define REG34A	0x4A
	#define REG34B	0x4B
	#define REG34C	0x4C
	#define REG34D	0x4D
	#define REG34E	0x4E
	#define REG34F	0x4F

	#define REG350	0x50
	#define REG351	0x51
	#define REG352	0x52
	#define REG353	0x53
	#define REG354	0x54
	#define REG355	0x55
	#define REG356	0x56
	#define REG357	0x57
	#define REG358	0x58
	#define REG359	0x59
	#define REG35A	0x5A
	#define REG35B	0x5B
	#define REG35C	0x5C
	#define REG35D	0x5D
	#define REG35E	0x5E
	#define REG35F	0x5F

