WeSpeakEnglish/STM32PLC/IAR/PLC/Inc/tw8819.h
	#define REG360	0x60
	#define REG361	0x61
	#define REG362	0x62
	#define REG363	0x63
	#define REG364	0x64
	#define REG365	0x65
	#define REG366	0x66
	#define REG367	0x67
	#define REG368	0x68
	#define REG369	0x69
	#define REG36A	0x6A
	#define REG36B	0x6B
	#define REG36C	0x6C
	#define REG36D	0x6D
	#define REG36E	0x6E
	#define REG36F	0x6F

	#define REG370	0x70
	#define REG371	0x71
	#define REG372	0x72
	#define REG373	0x73
	#define REG374	0x74
	#define REG375	0x75
	#define REG376	0x76
	#define REG377	0x77
	#define REG378	0x78
	#define REG379	0x79
	#define REG37A	0x7A
	#define REG37B	0x7B
	#define REG37C	0x7C
	#define REG37D	0x7D
	#define REG37E	0x7E
	#define REG37F	0x7F

	#define REG380	0x80
	#define REG381	0x81
	#define REG382	0x82
	#define REG383	0x83
	#define REG384	0x84
	#define REG385	0x85
	#define REG386	0x86
	#define REG387	0x87
	#define REG388	0x88
	#define REG389	0x89
	#define REG38A	0x8A
	#define REG38B	0x8B
	#define REG38C	0x8C
	#define REG38D	0x8D
	#define REG38E	0x8E
	#define REG38F	0x8F

	#define REG390	0x90
	#define REG391	0x91
	#define REG392	0x92
	#define REG393	0x93
	#define REG394	0x94
	#define REG395	0x95
	#define REG396	0x96
	#define REG397	0x97
	#define REG398	0x98
	#define REG399	0x99
	#define REG39A	0x9A
	#define REG39B	0x9B
	#define REG39C	0x9C
	#define REG39D	0x9D
	#define REG39E	0x9E
	#define REG39F	0x9F

	#define REG3A0	0xA0
	#define REG3A1	0xA1
	#define REG3A2	0xA2
	#define REG3A3	0xA3
	#define REG3A4	0xA4
	#define REG3A5	0xA5
	#define REG3A6	0xA6
	#define REG3A7	0xA7
	#define REG3A8	0xA8
	#define REG3A9	0xA9
	#define REG3AA	0xAA
	#define REG3AB	0xAB
	#define REG3AC	0xAC
	#define REG3AD	0xAD
	#define REG3AE	0xAE
	#define REG3AF	0xAF

	#define REG3B0	0xB0
	#define REG3B1	0xB1
	#define REG3B2	0xB2
	#define REG3B3	0xB3
	#define REG3B4	0xB4
	#define REG3B5	0xB5
	#define REG3B6	0xB6
	#define REG3B7	0xB7
	#define REG3B8	0xB8
	#define REG3B9	0xB9
	#define REG3BA	0xBA
	#define REG3BB	0xBB
	#define REG3BC	0xBC
	#define REG3BD	0xBD
	#define REG3BE	0xBE
	#define REG3BF	0xBF

	#define REG3C0	0xC0
	#define REG3C1	0xC1
	#define REG3C2	0xC2
	#define REG3C3	0xC3
	#define REG3C4	0xC4
	#define REG3C5	0xC5
	#define REG3C6	0xC6
	#define REG3C7	0xC7
	#define REG3C8	0xC8
	#define REG3C9	0xC9
	#define REG3CA	0xCA
	#define REG3CB	0xCB
	#define REG3CC	0xCC
	#define REG3CD	0xCD
	#define REG3CE	0xCE
	#define REG3CF	0xCF

	#define REG3D0	0xD0
	#define REG3D1	0xD1
	#define REG3D2	0xD2
	#define REG3D3	0xD3
	#define REG3D4	0xD4
	#define REG3D5	0xD5
	#define REG3D6	0xD6
	#define REG3D7	0xD7
	#define REG3D8	0xD8
	#define REG3D9	0xD9
	#define REG3DA	0xDA
	#define REG3DB	0xDB
	#define REG3DC	0xDC
	#define REG3DD	0xDD
	#define REG3DE	0xDE
	#define REG3DF	0xDF

	#define REG3E0	0xE0
	#define REG3E1	0xE1
	#define REG3E2	0xE2
	#define REG3E3	0xE3
	#define REG3E4	0xE4
	#define REG3E5	0xE5
	#define REG3E6	0xE6
	#define REG3E7	0xE7
	#define REG3E8	0xE8
	#define REG3E9	0xE9
	#define REG3EA	0xEA
	#define REG3EB	0xEB
	#define REG3EC	0xEC
	#define REG3ED	0xED
	#define REG3EE	0xEE
	#define REG3EF	0xEF

	#define REG3F0	0xF0
	#define REG3F1	0xF1
	#define REG3F2	0xF2
	#define REG3F3	0xF3
	#define REG3F4	0xF4
	#define REG3F5	0xF5
	#define REG3F6	0xF6
	#define REG3F7	0xF7
	#define REG3F8	0xF8
	#define REG3F9	0xF9
	#define REG3FA	0xFA
	#define REG3FB	0xFB
	#define REG3FC	0xFC
	#define REG3FD	0xFD
	#define REG3FE	0xFE
//#define REG3FF	0xFF

//#define	ReadTW88(a, b)		I2C_BufferRead( TW8819_ADDRESS, a, b, 1, 0)
//#define	WriteTW88(a, b)		I2C_BufferWrite(TW8819_ADDRESS, a, b, 1, 0) // I2C_BufferWrite(uint8_t dev,uint16_t addr, uint8_t *buf, uint16_t len,uint8_t mode16)
//#define WriteTW88Page(a)	HAL_I2C_Master_Transmit(&hi2c2, TW8819_ADDRESS, a, 2, 1000);//I2C_BufferWrite(TW8819_ADDRESS, 0xff, a, 1, 0) uint8_t I2C_BufferWrite(uint8_t dev,uint16_t addr, uint8_t *buf, uint16_t len,uint8_t mode16)
#define PAGE0_GENERAL		0x00
#define PAGE0_OUTPUT		0x00	//0x007::0x00F & 0x01F
#define PAGE0_INPUT			0x00	//0x040::0x046
#define PAGE0_BT656			0x00	//0x047::0x04A
#define PAGE0_DTV			0x00	//0x050::0x05F
#define PAGE0_GPIO			0x00	//0x080::0x09E
#define PAGE0_MBIST			0x00	//0x0A0::0x0A4
#define PAGE0_TOUCH			0x00	//0x0B0::0x0B4
#define PAGE0_LOPOR			0x00	//0x0D4::0x0DF
#define PAGE0_LEDC			0x00	//0x0E0::0x0E6
#define PAGE0_DCDC			0x00	//0x0E8::0x0EC
#define PAGE0_VCOM			0x00	//0x0ED::0x0EE
#define PAGE0_SSPLL			0x00	//0x0F6::0x0FD
#define PAGE1_DECODER		0x01	//0x101::0x142
#define PAGE1_VADC			0x01	//0x1C0::0x1E7	include LLPLL
#define PAGE2_SCALER		0x02	//0x201::0x21E
#define PAGE2_TCON			0x02	//0x240::0x24E
#define PAGE2_IMAGE			0x02	//0x280::0x2BF
#define PAGE2_GAMMA			0x02	//0x2E0::0x2E3 include LCDC
#define PAGE2_DITHER		0x02	//0x2E4::0x2E4
#define PAGE2_RGBLEVEL		0x02	//0x2F0::0x2F5
#define PAGE2_8BITPANEL		0x02	//0x2F8::0x2F9
#define PAGE3_FOSD			0x03	//0x300::0x354
#define PAGE4_SOSD			0x04	//0x400::0x3BE
#define PAGE3_SPI			0x04	//0x4C0::0x4DA include MCU
#define PAGE4_SPI			0x04	//0x4C0::0x4DA include MCU
#define TWBASE_SPI			0xC0	//note:Not a page. it is a offset.
#define PAGE4_CLOCK			0x04	//0x4E0::0x4EB
#define PAGE5_MEAS			0x05	//0x500::0x545

//-----------------------------------------------------------------------------
//				Individual Decoder Registers 
//-----------------------------------------------------------------------------

#define	REG_PAGE		0xff

//-----------------------------------------------------------------------------
//				Common Registers : Page 1
//-----------------------------------------------------------------------------
#define CSTATUS			0x01	// Chip Status
#define INFORM			0x02	// Input Format
#define ACNTL			0x06	// Analog Control
#define CROP_HI			0x07	// Cropping High
#define VDELAY_LO		0x08	// Vertical Delay Low
#define VACTIVE_LO		0x09	// Vertical Active Low
#define HDELAY_LO		0x0a	// Horizontal Delay Low
#define HACTIVE_LO		0x0b	// Horizontal Active Low
#define CNTRL1			0x0c	// Control 1
#define	CC_WSS			0x0d	// closed caption

#define BRIGHT			0x10	// Brightness Control
#define CONTRAST		0x11	// Contrast Control
#define SHARPNESS		0x12	// Sharpness Control
#define SAT_U			0x13	// Chroma(U) Gain
#define SAT_V			0x14	// Chroma(V) Gain
#define HUE				0x15	// Hue Conrol
#define V_PEAKING		0x17	// Vertical Peaking
#define CORING			0x18	// Coring Control Register

#define CC_STATUS		0x1a	// CC/EDS Status
#define CC_DATA			0x1b	// CC/EDS Data
#define SDT				0x1c	// Standard Selection
#define SDTR			0x1d	// Standard Recognition
#define CVFMT			0x1e	// Component Video Format

#define	CLMPG			0x20	// Clamping Gain
#define	IAGC			0x21	// Individual AGC Gain
#define	AGCGAIN			0x22	// AGC Gain
#define	PEAKWT			0x23	// White Peak Threshold
#define	CLMPL			0x24	// Clamping Level
#define	SYNCT			0x25	// Sync Amplitude
#define	MISSCNT			0x26	// Sync Miss Count
#define	PCLAMP			0x27	// Clamping Position

