WeSpeakEnglish/STM32PLC/IAR/PLC/Inc/tw8819.h
#define V_CONTROL1		0x28	// Vertical Control I
#define V_CONTROL2		0x29	// Vertical Control II
#define HFILTER			0x2c	// LUMA nad HFilter Control
#define MISC1			0x2d	// Miscellaneous Control 1
#define MISC2			0x2e	// Miscellaneous Control 2
#define MISC3			0x2f	// Miscellaneous Control 2

#define MACROV			0x30	// Macrovision control
#define CSTATUS2		0x31	// Chip Status 2
#define HFREF			0x32	// H Monitor
#define CLMD			0x33	// Clamp Mode
#define NSP_SEN			0x34	// ID Detection Control
#define CLCNTL			0x35	// Clamp Control

#define WSS0			0x40	// WSS data bit[19:14]
#define WSS1			0x41	// WSS data bit[13:8]
#define WSS2			0x42	// WSS data bit[7:0]


//=================== page 2 ==================================================
#define SHUE			0x80	// RGB Hue
#define SCONTRAST_R		0x81	// Red Contrast
#define SCONTRAST_G		0x82	// Green Contrast
#define SCONTRAST_B		0x83	// Blue Contrast
#define SCONTRAST_Y		0x84	// Y Contrast
#define SCONTRAST_Cb	0x85	// Cb Contrast
#define SCONTRAST_Cr	0x86	// Cr Contrast
#define SBRIGHT_R		0x87	// Red Brightness
#define SBRIGHT_G		0x88	// Green Brightness
#define SBRIGHT_B		0x89	// Blue Brightness
#define SBRIGHT_Y		0x8a	// Y Brightness
/*
#define RGBCONTROL		0x36	// RGB Powerdown..
#define RGBMISC			0x39
#define FBCONTRL		0x3F
*/
#define PNLSHARPNESS	0x8B	// Sharpness Control
#define FWVER			0x003		// rev 0.03

#define DEVICE_ID_TW8819	0x8a

#define REMO_RC5

//-----------------------------------------------------------------------------
//		Panel Resolution
//-----------------------------------------------------------------------------
#define	PANEL_H		800
#define	PANEL_V		480
#define PHR_ PANEL_H
#define PVR_ PANEL_V

#define SUPPORT_CVBS2

//color type
#define	RED		0
#define	GREEN	1
#define	BLUE	2
#define WHITE	3

#define NIL			0xff

#define UNKNOWN	0xfe
//VInputStd
#define NTSC	1			
#define PAL		2
#define SECAM	3
#define NTSC4	4
#define PALM	5
#define PALN	6
#define PAL60	7
extern uint8_t Sharpness[];
extern uint8_t InitCVBSAll[];

uint16_t SetYCbCrContrast(uint16_t val);
uint16_t ReadYCbCrContrast(void);
uint16_t SetYCbCrBright(uint16_t val);
uint16_t ReadYCbCrBright(void);
uint16_t SetYCbCrSaturation(uint16_t val);
uint16_t ReadYCbCrSaturation(void);
uint16_t SetYCbCrHUE(uint16_t val);
uint16_t ReadYCbCrHUE(void);
uint16_t SetYCbCrSharp(uint16_t val);
uint16_t ReadYCbCrSharp(void);


////////////
uint8_t ReadTW88(uint8_t addr); 
void WriteTW88(uint8_t addr, uint8_t buf);
void WriteTW88Page(uint8_t buf);
//


void I2CDeviceInitialize(uint8_t *RegSet);
void BlueScreenOnOff(uint8_t on);
void WaitVBlank(uint8_t cnt);
void ReadTW8819ID(void);
void Switch_Camera(uint8_t cam);
uint8_t ChangeCVBS(void);
void LCD_Video_GPIO_Deinit(void);
void LCD_Video_GPIO_Init(void);
void OSDSetDEDelay(void);
#endif